tap "homebrew/services"
brew "asdf"
brew "coreutils"
brew "emacs"
brew "gcc"
brew "gh"
brew "git"
brew "imagemagick"
brew "jpegoptim"
brew "jq"
brew "node"
brew "mongosh"
brew "pipx"
brew "postgresql@14", link: false
brew "postgresql@17"
brew "rbenv"
brew "spim"
brew "stow"
brew "tree"
cask "font-hack-nerd-font"
vscode "albert.tabout"
vscode "bradlc.vscode-tailwindcss"
vscode "digitalbrainstem.javascript-ejs-support"
vscode "docker.docker"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "humao.rest-client"
vscode "james-yu.latex-workshop"
vscode "janisdd.vscode-edit-csv"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "mosapride.zenkaku"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "shopify.ruby-lsp"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "wart.ariake-dark"
vscode "yzhang.markdown-all-in-one"
